"use strict";
// Да се напише програма, която изписва в конзолата сумата на четните числа, които се делят на 3, в интервала [1 - 20] включително.

// очакван отговор: sum = 36

// ОТГОВОР:
// определям променлива sum, която съдържа 0. В нея ще съхранявам резултата от събирането и деленето на четните числа
let sum = 0;

/*  Използвам for loop за изчислението, с който да премина през цифрите от 1 до 20. За да мога да премина през цифрите от 1 до 20 създавам променливата let x = 1;
Променливата x = 1 я използвам, като начална точка - от нея започва броенето в цикъла.
В for loop използвам if statement, в който извършвам изчислението.
Вътре в if statement използвам модулния оператор %, за да проверя дали текущото число x е четно (т.е. ако x % 2 === 0).
Ако числото е четно, го добавяме към сбора.
Накрая събирам стойноста на променливата sum с резултата в променливата x разделена на 3 (sum = sum + (x / 3);)
*/
for (let x = 1; x <= 20; x++) {
  if (x % 2 === 0) {
    sum += x / 3;
  }
}
// Резултата е 36.6666...за това закръглям резултата до 36, като използвам Math.floor(). Ако използвам .toFixed() ще ми закръгли отговора на 37.
console.log(Math.floor(sum));
